OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/adjoint/adjointSimpleFoam/pitzDaily3d/system/decomposeParDict

// * * * * * * * * * //
FoamFile
{
	version 0.5;
	format ascii;
	root "ROOT";
	case "CASE";
	class dictionary;
	object nix;
}
method simple;
numberOfSubdomains 8;
simpleCoeffs
{
  delta 0.0001;
  n (4 2 1);
}
